src/Catalogs/Web1C_Компоненты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Web1C_Компоненты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИсточникаДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Web1C_ВидыИсточниковДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Список</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВходящиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДляПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/Web1C_ВидыИсточниковДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>Web1C_ВидыИсточниковДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Список</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСОбработкойРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйКод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Web1C_ИсточникДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Web1C_ИсточникДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Web1C_Компоненты/Ext/ObjectModule.bsl
Функция ПолучитьТекстМакета(ВходящиеПараметры) Экспорт 
	Результат = "";
	
	Для каждого ТекСтрокаСостава Из Состав Цикл
		Если ТекСтрокаСостава.ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.Запрос") Тогда
			Результат = Результат + ПолучитьТекстПоЗапросу(ТекСтрокаСостава, ВходящиеПараметры) + Символы.ПС;
		ИначеЕсли ТекСтрокаСостава.ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ПростойТекст") Тогда
			Результат = Результат + ТекСтрокаСостава.Текст + Символы.ПС;
		ИначеЕсли ТекСтрокаСостава.ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.Значение") Тогда
			
		ИначеЕсли ТекСтрокаСостава.ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.Объект") Тогда
			Результат = Результат + Строка(ТекСтрокаСостава.ИсточникДанных) + Символы.ПС;
		ИначеЕсли ТекСтрокаСостава.ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.Список") Тогда
			
		ИначеЕсли ТекСтрокаСостава.ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ЗапросСОбработкойРезультата") Тогда
			Результат = Результат + ПолучитьТекстПоЗапросуСОбработкой(ТекСтрокаСостава, ВходящиеПараметры) + Символы.ПС;
		ИначеЕсли ТекСтрокаСостава.ВидИсточникаДанных = ПредопределенноеЗначение("Перечисление.Web1C_ВидыИсточниковДанных.ПроизвольныйКод") Тогда
			Результат = Результат + ПолучитьТекстПроизволныйКод(ТекСтрокаСостава, ВходящиеПараметры) + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьТекстПоЗапросу(СтрокаСостава, ВходящиеПараметры)
	Результат = "";
	Эталон = СтрокаСостава.Текст;
	
	ИсточникОб = СтрокаСостава.ИсточникДанных.получитьОбъект();
	Если Ложь Тогда
		ИсточникОб = Справочники.Web1C_ИсточникДанных.СоздатьЭлемент()
	КонецЕсли;
	
	Поля = ИсточникОб.Поля.Выгрузить();
	
	Выборка = ПолучитьВыборкуЗапросаИсточника(СтрокаСостава, ВходящиеПараметры);
	Пока Выборка.Следующий() Цикл
		ТекущаяСтрока = Эталон;
		Для каждого Поле Из поля Цикл
			ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока, "{#Поле_" + Поле.ИмяПоля + "#}", ?(ЗначениеЗаполнено(Поле.Формат), Формат(Выборка[Поле.ИмяПоля], Поле.Формат), Выборка[Поле.ИмяПоля]));
		КонецЦикла;
		Результат = Результат + ТекущаяСтрока + Символы.ПС;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьТекстПоЗапросуСОбработкой(СтрокаСостава, ВходящиеПараметры)
	Результат = "";
	Эталон = СтрокаСостава.Текст;
	
	ИсточникОб = СтрокаСостава.ИсточникДанных.получитьОбъект();
	Если Ложь Тогда
		ИсточникОб = Справочники.Web1C_ИсточникДанных.СоздатьЭлемент()
	КонецЕсли;
	
	Выборка = ПолучитьВыборкуЗапросаИсточника(СтрокаСостава, ВходящиеПараметры);
	НомерСтроки = 0;
	
	Поля = ИсточникОб.Поля.Выгрузить();
	
	СобытияЖурналаРегистрации = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		ВыборкаДанных = Новый Структура;
		Для каждого Поле Из поля Цикл
			ВыборкаДанных.Вставить(Поле.ИмяПоля, Выборка[Поле.ИмяПоля]);
		КонецЦикла;
		КодВыполнения = Эталон;
		ВыходнаяСтрока = "";
		НомерСтроки = НомерСтроки + 1;
		Попытка
			Выполнить КодВыполнения;
		Исключение
			текстОшибки = ОписаниеОшибки() + " - " + КодВыполнения;
			Сообщить("Во время выполнения произошла ошибка - " + текстОшибки);
			СобытияЖурналаРегистрации.Добавить(Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия", "Компоненты.ОшибкаВыполнения", "Ошибка", текстОшибки, ТекущаяДата()));
		КонецПопытки;
		Результат = Результат + ВыходнаяСтрока + Символы.ПС;
	КонецЦикла; 
	
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияЖурналаРегистрации);
	
	Возврат Результат;
КонецФункции

Функция ПолучитьВыборкуЗапросаИсточника(СтрокаСостава, ВходящиеПараметры)
	Результат = Неопределено;
	
	ИсточникОб = СтрокаСостава.ИсточникДанных.получитьОбъект();
	Если Ложь Тогда
		ИсточникОб = Справочники.Web1C_ИсточникДанных.СоздатьЭлемент()
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаСостава.Параметры) Тогда
		ПараметрыИсточника = ЗначениеИзСтрокиВнутр(СтрокаСостава.Параметры).ПараметрыИсточника;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ИсточникОб.ТекстЗапроса;
	
	Для каждого Параметр Из ИсточникОб.Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Параметр, Параметр.Значение);
	КонецЦикла;
	
	Если ПараметрыИсточника <> Неопределено Тогда
		Для каждого Параметр Из ПараметрыИсточника Цикл
			Если Параметр.ИсточникЗначения = 0 Тогда
				Запрос.УстановитьПараметр(Параметр.Параметр, Параметр.Значение);
			Иначе
				Запрос.УстановитьПараметр(Параметр.Параметр, ВходящиеПараметры[Параметр.Значение] );
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	//Общие праметры
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//Для каждого Параметр Из ВходящиеПараметры Цикл
	//	Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	//КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = РезультатЗапроса.Выбрать();
	
	Возврат Результат;
КонецФункции

Функция ПолучитьТекстПроизволныйКод(СтрокаСостава, ВходящиеПараметры)
	Результат = "";
	Эталон = СтрокаСостава.Текст;
	
	НомерСтроки = 0;
	КодВыполнения = Эталон;
	ВыходнаяСтрока = "";
	Попытка
		Выполнить КодВыполнения;
	Исключение
		СобытияЖурналаРегистрации = Новый СписокЗначений;
		СобытияЖурналаРегистрации.Добавить(Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия", "Компоненты.ОшибкаВыполнения", "Ошибка", ОписаниеОшибки() + " - " + КодВыполнения, ТекущаяДата()));
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияЖурналаРегистрации);
		
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Результат = Результат + ВыходнаяСтрока + Символы.ПС; 
	
	Возврат Результат;
КонецФункции
